IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM0_CONTROLSS_G3_EPWM0.xml
	<register id="CONTROLSS_G3_EPWM0_DCCAPCTL" acronym="CONTROLSS_G3_EPWM0_DCCAPCTL" offset="0x190" width="16" description="Digital Compare Capture Control Register">
		<bitfield id="CAPMODE" width="1" begin="15" end="15" resetval="0x0" description="Counter Capture Mode   0: When a DCEVTFILT occurs and the counter capture is enabled, then the current TBCNT value is captured in the active register. When the respective trip event occurs, further trip [capture] events are ignored until the next PRD_eq or CNT_zero event [as selected by the PULSESEL bit in the DCFCTL register] re-triggers the capture mechanism.  If active mode is enabled, via SHDWMODE bit in DCCAPCTL register, CPU reads of this register will return the active register value.  If shadow mode is enabled, via SHDWMODE bit in DCCAPCTL register, the active register is copied to the shadow register on the PRD_eq or CNT_zero event [whichever is selected by PULSESEL bit in DCFCTL register]. CPU reads of this register will return the shadow register value.   1: When a DCEVTFILT occurs and the counter capture is enabled, then the current TBCNT value is captured in the active register. When the respective trip event occurs - it will set the CAPSTS flag and further trip [capture] events are ignored until this bit is cleared. CAPSTS can be cleared by writing to CAPCLR bit in DCCAPCTL register and it re-triggers the capture mechanism.  If active mode is enabled, via SHDWMODE bit in DCCAPCTL register, CPU reads of this register will return the active register value.  If shadow mode is enabled, via SHDWMODE bit in DCCAPCTL register, the active register is copied to the shadow register on the PRD_eq or CNT_zero event [whichever is selected by PULSESEL bit in DCFCTL register]. CPU reads of this register will return the shadow register value." range="15" rwaccess="R/W"/> 
		<bitfield id="CAPCLR" width="1" begin="14" end="14" resetval="0x0" description="DC Capture Latched Status Clear Flag   0: Writing a 0 has no effect.  1: Writing a 1 will clear this CAPSTS [set] condition." range="14" rwaccess="R/W1TS"/> 
		<bitfield id="CAPSTS" width="1" begin="13" end="13" resetval="0x0" description="Latched Status Flag for Capture Event   0: No DC capture event occurred.  1: A DC capture event has occurred." range="13" rwaccess="R"/> 
		<bitfield id="SHDWMODE" width="1" begin="1" end="1" resetval="0x0" description="TBCTR Counter Capture Shadow Select Mode   0: Enable shadow mode. The DCCAP active register is copied to shadow register on a TBCTR = TBPRD or TBCTR = zero event as defined by the DCFCTL[PULSESEL] bit. CPU reads of the DCCAP register will return the shadow register contents.  1: Active Mode. In this mode the shadow register is disabled. CPU reads from the DCCAP register will always return the active register contents." range="1" rwaccess="R/W"/> 
		<bitfield id="CAPE" width="1" begin="0" end="0" resetval="0x0" description="TBCTR Counter Capture Enable/Disable   0: Disable the time-base counter capture.  1: Enable the time-base counter capture." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM0_DCFOFFSET" acronym="CONTROLSS_G3_EPWM0_DCFOFFSET" offset="0x192" width="16" description="Digital Compare Filter Offset Register ">
		<bitfield id="DCFOFFSET" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Offset  These 16-bits specify the number of TBCLK cycles from the blanking window reference to the point when the blanking window is applied. The blanking window reference is either period or zero as defined by the DCFCTL[PULSESEL] bit. This offset register is shadowed and the active register is loaded at the reference point defined by DCFCTL[PULSESEL]. The offset counter is also initialized and begins to count down when the active register is loaded. When the counter expires, the blanking window is applied. If the blanking window is currently active, then the blanking window counter is restarted." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM0_DCFOFFSETCNT" acronym="CONTROLSS_G3_EPWM0_DCFOFFSETCNT" offset="0x194" width="16" description="Digital Compare Filter Offset Counter Register">
		<bitfield id="DCFOFFSETCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Offset Counter  These 16-bits are read only and indicate the current value of the offset counter. The counter counts down to zero and then stops until it is re-loaded on the next period or zero event as defined by the DCFCTL[PULSESEL] bit. The offset counter is not affected by the free/soft emulation bits. That is, it will always continue to count down if the device is halted by a emulation stop." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM0_DCFWINDOW" acronym="CONTROLSS_G3_EPWM0_DCFWINDOW" offset="0x196" width="16" description="Digital Compare Filter Window Register">
		<bitfield id="DCFWINDOW" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Width   00h: No blanking window is generated.  01-FFFFh: Specifies the width of the blanking window in TBCLK cycles. The blanking window begins when the offset counter expires. When this occurs, the window counter is loaded and begins to count down. If the blanking window is currently active and the offset counter expires, the blanking window counter is not restarted and the blanking window is cut short prematurely. Care should be taken to avoid this situation. The blanking window can cross a PWM period boundary." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM0_DCFWINDOWCNT" acronym="CONTROLSS_G3_EPWM0_DCFWINDOWCNT" offset="0x198" width="16" description="Digital Compare Filter Window Counter Register">
		<bitfield id="DCFWINDOWCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Counter  These 16 bits are read only and indicate the current value of the window counter. The counter counts down to zero and then stops until it is re-loaded when the offset counter reaches zero again." range="15 - 0" rwaccess="R"/>
	</register>
